---
kind: type
id: T:Autodesk.Revit.DB.FabricationAncillaryUsage
source: html/558a5a38-b4d8-84ed-3260-3253db661a62.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage

Structure that holds information about the usage of a fabrication ancillary

## Syntax (C#)
```csharp
public class FabricationAncillaryUsage : IDisposable
```